fixing mermaid code
